#1 Напишіть програму, яка вітає користувача, виводячи слово `Hello`, введене користувачем ім'я та розділові знаки за зразком:Hello, Kitty!
#name = input('Как вас зовут?')
#print('Hello,', name+'!')

#2 Напишіть програму, яка зчитує ціле число та виводить текст, аналогічний наведеному у прикладі

# human_number = int(input("Please enter an integer number: "))
# next = str(human_number + 1)
# previous = human_number - 1
# print('Next number for number', human_number, 'is', next+".")
# print('Previous number for number', human_number, 'is', previous, end=".")

# Про задание с Васей я на 3м уроке увидел разбор, переписал его, разобрался как работает abs
# Було тяжковато самому додуматься по решениию

# v = int(input('PLease enter your speed:'))
# t = int(input('Please enter your time:'))
# s = v * (abs(t))
# if v > 0 and s < 100:
#     print (f'You are already completed {s} km.Keep it ip!')
# elif v < 0 and s <=100:
#     print(f' You are delayed for {abs(s)} km. Harry up!')
# else:
#     print('Congratulations! You are already finished 100 km!')

#Задача с высокосным годом
# year = int(input('Please enter number of the year'))
# if (year %4 == 0) and (year % 100 != 0) or (year %400 == 0):
#     print("Yes")
# else:
#     print("No")

# xnumber = int(input('Enter number for X'))
# 1 if x >0, -1 if x <0, 0 if x == 0
# TODO нефуя не понятно

# N E X T


# print (type(x))
# print(int(x))
# print(int(x))
#list = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

#     for x in list == x
# print('Число пристуствует в списке')


  # Даний список із 10 елементів [10, 20, 30, 40, 50, 60, 70, 80, 90, 100].
  # Написати програму яка поверне:
  # Чи є x серед елементів.
  # Число на введення може бути як цілим числом, числом з точкою, що плаває, так і від'ємним,
  # тобто. x = -10.00 має повернути що x є у списку.
  # ** В ідеалі список повинен бути записаний як кортеж один раз
# x = (input(int(("Enter number"))
# print("hello")


#done
#5
# x = int(input('Enter X'))
# if x > 0:
#     print('1')
# elif x == 0:
#     print(0)
# else:
#     print('-1')

# #6
# x = float(input('Enter number X'))
# x = (abs(x))
# spisok = list(range( 10, 101, 10 ))
# if x in spisok:
#      print('Это число есть в списке')
# else: print('Этого числа нет в списке')

# #7
# n = int(input("Сколько звезд ты хочешь"))
# star = '*'
# print(n * star)
