import this
#ok - получил внегласные правила использования кода пайтон
import antigravity
#ok комиксы про пайтон
import __hello__
#получил Hello world! Но сначала подумал что надо создать файл Hello, я его создал, прописал команду но при запуске кода, у меня читался код с моего основного файла, я так не понял как вызвать запуск кода с другого файла(

from __future__ import braces
#выдал ошибку, прогуглив оказалось, что команда означает обьявление о написании кода с участием {}.Но пайтон так не работает) оказывается одна из скрытых шуток разработчиков кода'
