n = (1, 2, 3, 4, 5, 6, 7, 8, 9)
print('Третій символ',n[2]) #Виведіть третій символ цього рядка
print('Передостанній символ',n[-2]) #виведіть передостанній символ цього рядка
print('Перші пять символів',n[-0:5]) #виведіть перші #пять символів цього рядка
print('Весь рядок, крім двох останніх символів',n[:-2])#виведіть весь рядок, крім двох останніх символів

#усі символи з парними індексами (вважаючи, що індексація починається з 0, тому символи виводяться починаючи
numbers = list(n)
even = filter(lambda n: n % 2 == 0, numbers)
odd = filter(lambda n: n % 2 == 1, numbers)
print('Парні',list(even)) # [2]
print('Не парні',list(odd)) # [1,3]

#виведіть усі символи з непарними індексами, тобто, починаючи з другого символу рядка.
pr = n[::2]
print('Символи з непарними індексами',pr)

#виведіть усі символи у зворотному порядку
zp = n[::-1]
print('Символи у зворотному порядку',zp)

#виведіть усі символи рядка через один у зворотному порядку, починаючи з останнього
zp1 = n[::-2]
print('Символи рядка через один у зворотному порядку, починаючи з останнього',zp1)
#виведіть довжину цього рядка
long = len(n)
print('Довжина цього рядка',long)